;;; D - Restore the Tree

;;; -*- 問題文 -*-
;;; N 頂点の根付き木があり、その頂点には 1 から N までの番号が振られています。
;;; 根以外の各頂点には、その親から一本の有向辺が伸びています。
;;; なお、根は頂点 1 とは限りません。

;;; 高橋くんは、このグラフに M 本の新たな有向辺を書き加えました。
;;; 書き足された各辺 u -> v は、ある頂点 u からその子孫であるような頂点 v に向かって伸びています。

;;; 高橋くんが辺を書き加えたあとの N 頂点、 N~1+M 辺の有向グラフが与えられます。
;;; より具体的には、N~1+M 組の整数のペア (A1, B1), ..., (A_N~1+M, B_N~1+M) が与えられ、これらは i 番目の辺が頂点 Ai から頂点 Biに向かって伸びていることを表します。

;;; 元の根付き木を復元してください。

;;; -*- 制約 -*-
;;; 3 <= N
;;; 1 <= M
;;; N+M <= 10^5
;;; 1 <= Ai,Bi <= N
;;; Ai != Bi
;;; i != j ならば (Ai, Bi) != (Aj, Bj)
;;; 入力されるグラフは、N 頂点の根付き木に問題文中の条件を満たす M 本の辺を書き足すことで得られる。

;;; -*- 入力 -*-
;;; 入力は以下の形式で標準入力から与えられる。
;;; N          M
;;; A1         B1
;;; :
;;; A_N-1+M    BN_1+M

;;; -*- 出力 -*-
;;; N行出力せよ。
;;; i 行目には、頂点 i が元の木の根であれば 0 を出力し、そうでなければ元の木で頂点 iの親を表す整数を出力すること。
;;; なお、元の木は一意に定まることが示せる。


;;; 頂点の数
(defparameter *node-number* (read))
;;; 辺の数
(defparameter *link-number* (read))

